gpu/rapidcfd/cases/vg16p50_a18/0/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (36.0892 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (36.0892 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (36.0892 0 0);
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    sideLeft
    {
        type            slip;
    }

    sideRight
    {
        type            slip;
    }

    wing
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}
